prod-deploy/results/prod-nolimit-rootcause-cephfs-20260716-220958/step3-cephfs/rep-randrw-D2-r1-fio.txt
storage_test: (g=0): rw=randrw, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=8
...
fio-3.28
Starting 16 processes

storage_test: (groupid=0, jobs=16): err= 0: pid=3299814: Thu Jul 16 22:42:15 2026
  read: IOPS=9360, BW=2340MiB/s (2454MB/s)(411GiB/180006msec)
    slat (usec): min=4, max=7210, avg=64.25, stdev=124.51
    clat (nsec): min=275, max=60525k, avg=3604289.71, stdev=3877820.66
     lat (usec): min=179, max=60547, avg=3668.65, stdev=3900.05
    clat percentiles (usec):
     |  1.00th=[  231],  5.00th=[  318], 10.00th=[  482], 20.00th=[  799],
     | 30.00th=[ 1037], 40.00th=[ 1352], 50.00th=[ 1860], 60.00th=[ 2737],
     | 70.00th=[ 4293], 80.00th=[ 6521], 90.00th=[ 9241], 95.00th=[11469],
     | 99.00th=[16319], 99.50th=[18482], 99.90th=[25035], 99.95th=[28705],
     | 99.99th=[41681]
   bw (  MiB/s): min= 1661, max= 2723, per=100.00%, avg=2340.57, stdev=12.08, samples=2880
   iops        : min= 5998, max=11776, avg=9361.99, stdev=58.37, samples=5760
  write: IOPS=9369, BW=2342MiB/s (2456MB/s)(412GiB/180006msec); 0 zone resets
    slat (usec): min=6, max=7447, avg=127.34, stdev=140.79
    clat (usec): min=147, max=67535, avg=9867.24, stdev=6617.09
     lat (usec): min=673, max=67717, avg=9994.70, stdev=6625.46
    clat percentiles (usec):
     |  1.00th=[  979],  5.00th=[ 1631], 10.00th=[ 2311], 20.00th=[ 3687],
     | 30.00th=[ 5342], 40.00th=[ 7111], 50.00th=[ 8848], 60.00th=[10683],
     | 70.00th=[12649], 80.00th=[15139], 90.00th=[18744], 95.00th=[21890],
     | 99.00th=[29492], 99.50th=[33162], 99.90th=[41681], 99.95th=[45351],
     | 99.99th=[53740]
   bw (  MiB/s): min= 1699, max= 2616, per=100.00%, avg=2342.62, stdev=10.41, samples=2880
   iops        : min= 6336, max=10898, avg=9370.20, stdev=46.99, samples=5760
  lat (nsec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.90%, 500=4.32%, 750=3.67%, 1000=5.91%
  lat (msec)   : 2=15.06%, 4=15.30%, 10=29.00%, 20=21.92%, 50=3.91%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.97%, sys=6.83%, ctx=4769703, majf=2, minf=2742
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1685034,1686553,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=2340MiB/s (2454MB/s), 2340MiB/s-2340MiB/s (2454MB/s-2454MB/s), io=411GiB (442GB), run=180006-180006msec
  WRITE: bw=2342MiB/s (2456MB/s), 2342MiB/s-2342MiB/s (2456MB/s-2456MB/s), io=412GiB (442GB), run=180006-180006msec